; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	infrared2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star5 - direction
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star5)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
	(supports instrument9 infrared2)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite1 Phenomenon12)
	(pointing satellite2 Star4)
	(pointing satellite3 GroundStation3)
	(have_image Star6 spectrograph1)
	(have_image Planet7 infrared2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 infrared2)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star0 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 star0)
   goals met: 2 of 12
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 2 of 12
3. (calibrate satellite3 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 2 of 12
4. (turn_to satellite3 phenomenon8 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 12
5. (take_image satellite3 phenomenon8 instrument8 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 3 of 12
6. (turn_to satellite3 phenomenon14 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon14)
   goals met: 3 of 12
7. (take_image satellite3 phenomenon14 instrument8 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 4 of 12
8. (turn_to satellite3 phenomenon12 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon12)
   goals met: 4 of 12
9. (take_image satellite3 phenomenon12 instrument8 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 5 of 12
10. (turn_to satellite3 phenomenon11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon11)
   goals met: 5 of 12
11. (take_image satellite3 phenomenon11 instrument8 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 12
12. (turn_to satellite3 planet13 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 planet13)
   goals met: 6 of 12
13. (take_image satellite3 planet13 instrument8 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 7 of 12
14. (turn_to satellite3 planet7 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet7)
   goals met: 7 of 12
15. (take_image satellite3 planet7 instrument8 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 8 of 12
16. (turn_to satellite3 star10 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star10)
   goals met: 8 of 12
17. (take_image satellite3 star10 instrument8 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 9 of 12
18. (turn_to satellite3 star6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star6)
   goals met: 9 of 12
19. (take_image satellite3 star6 instrument8 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 10 of 12
20. (turn_to satellite3 star9 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star9)
   goals met: 10 of 12
21. (take_image satellite3 star9 instrument8 infrared2)
   added: (have_image star9 infrared2)
   goals met: 11 of 12
22. (turn_to satellite3 groundstation3 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation3)
   goals met: 12 of 12
